# Working with pandas in class (classwork)

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("iris.csv")
print(data)

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [3]:
data.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [4]:
# From a list of list
l = [['ABC', 22, 'Sales'], ['BCD', 45 , 'HR'], ['CDE', 30, 'IT']]

In [8]:
df = pd.DataFrame(l, columns=['name','age','department']); print(df)

  name  age department
0  ABC   22      Sales
1  BCD   45         HR
2  CDE   30         IT

In [9]:
type(l), type(df)

(list, pandas.core.frame.DataFrame)

In [10]:
df

  name  age department
0  ABC   22      Sales
1  BCD   45         HR
2  CDE   30         IT

In [11]:
# From a dictionary of list
d = {"name": ['Biswarup','Bhavik','Manas','Mallu'], "marks": [82, 88, 78, 66]}

In [12]:
d

{'name': ['Biswarup', 'Bhavik', 'Manas', 'Mallu'], 'marks': [82, 88, 78, 66]}

In [13]:
df1 = pd.DataFrame(d); print(df1)

       name  marks
0  Biswarup     82
1    Bhavik     88
2     Manas     78
3     Mallu     66

In [14]:
type(d), type(df1)

(dict, pandas.core.frame.DataFrame)

In [15]:
df1

       name  marks
0  Biswarup     82
1    Bhavik     88
2     Manas     78
3     Mallu     66

In [16]:
# From a csv
data

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [17]:
data1 = pd.read_csv("name.csv")
print(data1)

      Name  Age            City
0    Alpha   25       Las Vegas
1     Beta   30   Washington DC
2    Gamma   20        New York
3    Delta   10          Seatle
4  Epsilon   30      Los Angles
5     Zeta            Minesotta
6    Setti               Norway

In [18]:
type(data1)

pandas.core.frame.DataFrame

In [19]:
# Print the sample of the dataframe
data1.head()

      Name  Age            City
0    Alpha   25       Las Vegas
1     Beta   30   Washington DC
2    Gamma   20        New York
3    Delta   10          Seatle
4  Epsilon   30      Los Angles

In [20]:
data1.tail()

      Name  Age         City
2    Gamma   20     New York
3    Delta   10       Seatle
4  Epsilon   30   Los Angles
5     Zeta         Minesotta
6    Setti            Norway

In [21]:
# Read with separators
df3 = pd.read_csv('name.csv', sep=',')
print(df3)

      Name  Age            City
0    Alpha   25       Las Vegas
1     Beta   30   Washington DC
2    Gamma   20        New York
3    Delta   10          Seatle
4  Epsilon   30      Los Angles
5     Zeta            Minesotta
6    Setti               Norway

In [ ]:
df4 = pd.read_csv('name.csv', sep='\t')  #Converted the total data as one record
print(df4)

           Name, Age, City
0     Alpha, 25, Las Vegas
1  Beta, 30, Washington DC
2      Gamma, 20, New York
3        Delta, 10, Seatle
4  Epsilon, 30, Los Angles
5         Zeta, ,Minesotta
6          Setti, , Norway

In [ ]:
# Create a dataframe with a few skip rows
df5 = pd.read_csv('name.csv', skiprows=3) # The new data collected
df5

     Gamma   20     New York
0    Delta   10       Seatle
1  Epsilon   30   Los Angles
2     Zeta         Minesotta
3    Setti            Norway

In [26]:
# Create a dataframe with specific columns
df6 = pd.read_csv('name.csv', usecols=['Name',' Age'])

In [27]:
df6

      Name  Age
0    Alpha   25
1     Beta   30
2    Gamma   20
3    Delta   10
4  Epsilon   30
5     Zeta
6    Setti

In [29]:
# Create a dataframe by replacing missing values with NaN
df7 = pd.read_csv('name.csv', na_values=['NA','?',' '])
df7

      Name   Age            City
0    Alpha  25.0       Las Vegas
1     Beta  30.0   Washington DC
2    Gamma  20.0        New York
3    Delta  10.0          Seatle
4  Epsilon  30.0      Los Angles
5     Zeta   NaN       Minesotta
6    Setti   NaN          Norway

In [30]:
# Create a dataframe with specific index column
df8 = pd.read_csv('name.csv', index_col=0)
df8

         Age            City
Name
Alpha     25       Las Vegas
Beta      30   Washington DC
Gamma     20        New York
Delta     10          Seatle
Epsilon   30      Los Angles
Zeta               Minesotta
Setti                 Norway

In [35]:
df9 = pd.read_csv('name.csv', index_col=[' Age'])
df9

         Name            City
 Age
25      Alpha       Las Vegas
30       Beta   Washington DC
20      Gamma        New York
10      Delta          Seatle
30    Epsilon      Los Angles
         Zeta       Minesotta
        Setti          Norway

In [37]:
df10 = pd.read_csv('name.csv', index_col=['Name',' City'])
df10

                        Age
Name     City
Alpha    Las Vegas       25
Beta     Washington DC   30
Gamma    New York        20
Delta    Seatle          10
Epsilon  Los Angles      30
Zeta    Minesotta
Setti    Norway

In [40]:
# Writing a dataframe into a csv file
df

  name  age department
0  ABC   22      Sales
1  BCD   45         HR
2  CDE   30         IT

In [41]:
df.to_csv('o1.csv', sep=',')

In [42]:
# Creating a csv file from a data frame without the index column
df.to_csv('o2.csv', index=False)

In [48]:
# Create a csv file from a dataframe with seperators
df.to_csv('o3.csv', sep=',', index=False)

In [47]:
df.to_csv('o4.csv', sep='\t', index=False)

In [50]:
# Access a data frame
df['name']

0    ABC
1    BCD
2    CDE
Name: name, dtype: object

In [51]:
type(df['name'])

pandas.core.series.Series

In [58]:
df['age']

0    22
1    45
2    30
Name: age, dtype: int64

In [61]:
df[['name','age']]

  name  age
0  ABC   22
1  BCD   45
2  CDE   30

In [64]:
# Filter Accessing
df_age = df[df['age']>25] # We can do the operations !!

In [65]:
df_age

  name  age department
1  BCD   45         HR
2  CDE   30         IT

In [66]:
data1

      Name  Age            City
0    Alpha   25       Las Vegas
1     Beta   30   Washington DC
2    Gamma   20        New York
3    Delta   10          Seatle
4  Epsilon   30      Los Angles
5     Zeta            Minesotta
6    Setti               Norway

In [67]:
df7

      Name   Age            City
0    Alpha  25.0       Las Vegas
1     Beta  30.0   Washington DC
2    Gamma  20.0        New York
3    Delta  10.0          Seatle
4  Epsilon  30.0      Los Angles
5     Zeta   NaN       Minesotta
6    Setti   NaN          Norway

In [68]:
# df7 has NaN values(check for missing and unknown values)
df7.isnull().sum()

Name     0
 Age     2
 City    0
dtype: int64

In [69]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1    Age    5 non-null      float64
 2    City   7 non-null      object
dtypes: float64(1), object(2)
memory usage: 300.0+ bytes

In [70]:
df7.isnull()

    Name    Age   City
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False   True  False
6  False   True  False

In [72]:
# Fill the Na values with 0
df7[' Age'] = df7[' Age'].fillna(0)

In [73]:
df7

      Name   Age            City
0    Alpha  25.0       Las Vegas
1     Beta  30.0   Washington DC
2    Gamma  20.0        New York
3    Delta  10.0          Seatle
4  Epsilon  30.0      Los Angles
5     Zeta   0.0       Minesotta
6    Setti   0.0          Norway

In [74]:
# Drop Na values
df7 = pd.read_csv('name.csv'); print(df7)

      Name  Age            City
0    Alpha   25       Las Vegas
1     Beta   30   Washington DC
2    Gamma   20        New York
3    Delta   10          Seatle
4  Epsilon   30      Los Angles
5     Zeta            Minesotta
6    Setti               Norway

In [75]:
df7.isnull().sum()

Name     0
 Age     0
 City    0
dtype: int64

In [76]:
df7 = pd.read_csv('name.csv', na_values=['NA','?',' '])
df7

      Name   Age            City
0    Alpha  25.0       Las Vegas
1     Beta  30.0   Washington DC
2    Gamma  20.0        New York
3    Delta  10.0          Seatle
4  Epsilon  30.0      Los Angles
5     Zeta   NaN       Minesotta
6    Setti   NaN          Norway

In [77]:
df7.isnull().sum()

Name     0
 Age     2
 City    0
dtype: int64

In [78]:
df11 = df7.dropna()

In [79]:
df11

      Name   Age            City
0    Alpha  25.0       Las Vegas
1     Beta  30.0   Washington DC
2    Gamma  20.0        New York
3    Delta  10.0          Seatle
4  Epsilon  30.0      Los Angles

In [85]:
# Add new columns to an existing dataframe\
df7['NewAge'] = df7[' Age'] + 10

In [86]:
df7

      Name   Age            City  NewAge
0    Alpha  25.0       Las Vegas    35.0
1     Beta  30.0   Washington DC    40.0
2    Gamma  20.0        New York    30.0
3    Delta  10.0          Seatle    20.0
4  Epsilon  30.0      Los Angles    40.0
5     Zeta   NaN       Minesotta     NaN
6    Setti   NaN          Norway     NaN

In [87]:
df7.to_csv('o6.csv', index=False)

In [88]:
# Create a file called as emp.csv that contain name, age , dep, sal read the file and add newcolumns - hra, da, pt, pf compute hra = 10% of sal, da is 50% of sal, pt - 5% of salary, pf - 5% of salary
# net = Salary + HRA + DA
# Gross = Net-(PT+PF)
# Create a new file that contains all these data

In [89]:
file = pd.read_csv('emp.csv'); print(file)

       name  age        department  salary
0    bhavik   23  computer_science   80000
1  biswarup   24  computer_science   88000
2      asif   25      data_analyst  100000
3     manas   28           sweeper    1200

In [ ]:
file